ad_fit_gear/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "xEz1OEDIQdk8RWTEwWLtyA"], ["updated_at", "2020-02-28 17:57:47.593962"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!