ad_fit_gear/app/controllers/api/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 7]]
---
    def index
        category_id = params[:category_id]
        @products = Product.where(category_id: category_id)

SELECT "products"."id" FROM "products" WHERE "products"."id" = $1 AND "products"."category_id" = $2  [["id", 1], ["category_id", 7]]
---
    def show
        category_id = params[:category_id]
        id = params[:id]
        @product = Product.where(id: id).where(category_id: category_id)